var data1 = [{ 
    "_id" :  ("59830ee98c01fb201388e0d6"), 
    "doctorSn" : "82509"
},
{ 
    "_id" :  ("59830ee98c01fb201388e107"), 
    "doctorSn" : "83521"
},
{ 
    "_id" :  ("59830ee98c01fb201388e13b"), 
    "doctorSn" : "83531"
},
{ 
    "_id" :  ("59830eea8c01fb201388e250"), 
    "doctorSn" : "83491"
},
{ 
    "_id" :  ("59830eea8c01fb201388e25a"), 
    "doctorSn" : "83507"
},
{ 
    "_id" :  ("59830eea8c01fb201388e281"), 
    "doctorSn" : "81463"
},
{ 
    "_id" :  ("59830eeb8c01fb201388e3c8"), 
    "doctorSn" : "79447"
},
{ 
    "_id" :  ("59830eeb8c01fb201388e3d5"), 
    "doctorSn" : "79462"
},
{ 
    "_id" :  ("59830eeb8c01fb201388e3dd"), 
    "doctorSn" : "79476"
},
{ 
    "_id" :  ("59830eec8c01fb201388e500"), 
    "doctorSn" : "77459"
},
{ 
    "_id" :  ("59830eec8c01fb201388e503"), 
    "doctorSn" : "77462"
},
{ 
    "_id" :  ("59830eec8c01fb201388e521"), 
    "doctorSn" : "76434"
},
{ 
    "_id" :  ("59830eec8c01fb201388e522"), 
    "doctorSn" : "76435"
},
{ 
    "_id" :  ("59830eec8c01fb201388e54d"), 
    "doctorSn" : "76490"
},
{ 
    "_id" :  ("59830eec8c01fb201388e54f"), 
    "doctorSn" : "76493"
},
{ 
    "_id" :  ("59830eec8c01fb201388e550"), 
    "doctorSn" : "76497"
},
{ 
    "_id" :  ("59830eec8c01fb201388e553"), 
    "doctorSn" : "76500"
},
{ 
    "_id" :  ("59830eec8c01fb201388e590"), 
    "doctorSn" : "80443"
},
{ 
    "_id" :  ("59830eec8c01fb201388e5b8"), 
    "doctorSn" : "67463"
},
{ 
    "_id" :  ("59830eed8c01fb201388e5f0"), 
    "doctorSn" : "68463"
},
{ 
    "_id" :  ("59830eed8c01fb201388e5fc"), 
    "doctorSn" : "68477"
},
{ 
    "_id" :  ("59830eed8c01fb201388e636"), 
    "doctorSn" : "69451"
},
{ 
    "_id" :  ("59830eed8c01fb201388e63d"), 
    "doctorSn" : "77474"
},
{ 
    "_id" :  ("59830eed8c01fb201388e63e"), 
    "doctorSn" : "77477"
},
{ 
    "_id" :  ("59830eed8c01fb201388e645"), 
    "doctorSn" : "77487"
},
{ 
    "_id" :  ("59830eed8c01fb201388e64a"), 
    "doctorSn" : "77496"
},
{ 
    "_id" :  ("59830eed8c01fb201388e684"), 
    "doctorSn" : "78445"
},
{ 
    "_id" :  ("59830eed8c01fb201388e68b"), 
    "doctorSn" : "78456"
},
{ 
    "_id" :  ("59830eed8c01fb201388e69d"), 
    "doctorSn" : "78487"
},
{ 
    "_id" :  ("59830eed8c01fb201388e6a5"), 
    "doctorSn" : "78499"
},
{ 
    "_id" :  ("59830eed8c01fb201388e6ac"), 
    "doctorSn" : "78518"
},
{ 
    "_id" :  ("59830eee8c01fb201388e70d"), 
    "doctorSn" : "70493"
},
{ 
    "_id" :  ("59830eee8c01fb201388e72b"), 
    "doctorSn" : "63488"
},
{ 
    "_id" :  ("59830eee8c01fb201388e73c"), 
    "doctorSn" : "65421"
},
{ 
    "_id" :  ("59830eee8c01fb201388e762"), 
    "doctorSn" : "63498"
},
{ 
    "_id" :  ("59830eee8c01fb201388e775"), 
    "doctorSn" : "63526"
},
{ 
    "_id" :  ("59830eee8c01fb201388e79c"), 
    "doctorSn" : "64441"
},
{ 
    "_id" :  ("59830eef8c01fb201388e7bf"), 
    "doctorSn" : "64494"
},
{ 
    "_id" :  ("59830eef8c01fb201388e7c6"), 
    "doctorSn" : "64503"
},
{ 
    "_id" :  ("59830eef8c01fb201388e7fc"), 
    "doctorSn" : "73527"
},
{ 
    "_id" :  ("59830eef8c01fb201388e7fe"), 
    "doctorSn" : "73529"
},
{ 
    "_id" :  ("59830eef8c01fb201388e847"), 
    "doctorSn" : "74468"
},
{ 
    "_id" :  ("59830eef8c01fb201388e853"), 
    "doctorSn" : "74485"
},
{ 
    "_id" :  ("59830ef08c01fb201388e88f"), 
    "doctorSn" : "75447"
},
{ 
    "_id" :  ("59830ef08c01fb201388e891"), 
    "doctorSn" : "75450"
},
{ 
    "_id" :  ("59830ef08c01fb201388e8b9"), 
    "doctorSn" : "65511"
},
{ 
    "_id" :  ("59830ef08c01fb201388e8ed"), 
    "doctorSn" : "66458"
},
{ 
    "_id" :  ("59830ef08c01fb201388e8ee"), 
    "doctorSn" : "66459"
},
{ 
    "_id" :  ("59830ef08c01fb201388e8fa"), 
    "doctorSn" : "66472"
},
{ 
    "_id" :  ("59830ef18c01fb201388e924"), 
    "doctorSn" : "73497"
},
{ 
    "_id" :  ("59830ef18c01fb201388e92c"), 
    "doctorSn" : "73508"
},
{ 
    "_id" :  ("59830ef18c01fb201388e934"), 
    "doctorSn" : "75515"
},
{ 
    "_id" :  ("59830ef18c01fb201388e962"), 
    "doctorSn" : "70538"
},
{ 
    "_id" :  ("59830ef18c01fb201388e964"), 
    "doctorSn" : "70542"
},
{ 
    "_id" :  ("59830ef18c01fb201388e966"), 
    "doctorSn" : "70545"
},
{ 
    "_id" :  ("59830ef18c01fb201388e99a"), 
    "doctorSn" : "72473"
},
{ 
    "_id" :  ("59830ef28c01fb201388e9eb"), 
    "doctorSn" : "71508"
},
{ 
    "_id" :  ("59830ef28c01fb201388ea61"), 
    "doctorSn" : "60429"
},
{ 
    "_id" :  ("59830ef38c01fb201388eae8"), 
    "doctorSn" : "72526"
},
{ 
    "_id" :  ("59830ef38c01fb201388eaed"), 
    "doctorSn" : "72533"
},
{ 
    "_id" :  ("59830ef48c01fb201388eb34"), 
    "doctorSn" : "73480"
},
{ 
    "_id" :  ("59830ef48c01fb201388eb5e"), 
    "doctorSn" : "59401"
},
{ 
    "_id" :  ("59830ef68c01fb201388ed33"), 
    "doctorSn" : "57453"
},
{ 
    "_id" :  ("59830efb8c01fb201388f032"), 
    "doctorSn" : "56802"
},
{ 
    "_id" :  ("59830efc8c01fb201388f10b"), 
    "doctorSn" : "76459"
},
{ 
    "_id" :  ("59830efd8c01fb201388f162"), 
    "doctorSn" : "64484"
},
{ 
    "_id" :  ("59830efe8c01fb201388f1e1"), 
    "doctorSn" : "85442"
},
{ 
    "_id" :  ("59830eff8c01fb201388f277"), 
    "doctorSn" : "78469"
},
{ 
    "_id" :  ("59830eff8c01fb201388f2aa"), 
    "doctorSn" : "81493"
},
{ 
    "_id" :  ("59830eff8c01fb201388f2b9"), 
    "doctorSn" : "67417"
},
{ 
    "_id" :  ("59830eff8c01fb201388f2bc"), 
    "doctorSn" : "73505"
},
{ 
    "_id" :  ("59830eff8c01fb201388f2c0"), 
    "doctorSn" : "73522"
},
{ 
    "_id" :  ("59830f028c01fb201388f407"), 
    "doctorSn" : "62475"
},
{ 
    "_id" :  ("59830f038c01fb201388f485"), 
    "doctorSn" : "79443"
},
{ 
    "_id" :  ("59830f038c01fb201388f4a0"), 
    "doctorSn" : "84513"
},
{ 
    "_id" :  ("59830f058c01fb201388f585"), 
    "doctorSn" : "83527"
},
{ 
    "_id" :  ("59830f058c01fb201388f5e4"), 
    "doctorSn" : "78521"
},
{ 
    "_id" :  ("59830f068c01fb201388f611"), 
    "doctorSn" : "79960"
},
{ 
    "_id" :  ("59830f068c01fb201388f612"), 
    "doctorSn" : "82541"
},
{ 
    "_id" :  ("59830f068c01fb201388f629"), 
    "doctorSn" : "75495"
},
{ 
    "_id" :  ("59830f068c01fb201388f652"), 
    "doctorSn" : "64470"
},
{ 
    "_id" :  ("59830f078c01fb201388f683"), 
    "doctorSn" : "84471"
},
{ 
    "_id" :  ("59830f078c01fb201388f693"), 
    "doctorSn" : "84465"
},
{ 
    "_id" :  ("59830f088c01fb201388f74f"), 
    "doctorSn" : "77495"
},
{ 
    "_id" :  ("59830f088c01fb201388f763"), 
    "doctorSn" : "65452"
},
{ 
    "_id" :  ("59830f0c8c01fb201388f8a4"), 
    "doctorSn" : "81535"
},
{ 
    "_id" :  ("59830f0c8c01fb201388f8c8"), 
    "doctorSn" : "85445"
},
{ 
    "_id" :  ("59830f0e8c01fb201388f993"), 
    "doctorSn" : "80446"
},
{ 
    "_id" :  ("59830f0e8c01fb201388f995"), 
    "doctorSn" : "78503"
},
{ 
    "_id" :  ("59830f0e8c01fb201388f9a9"), 
    "doctorSn" : "80492"
},
{ 
    "_id" :  ("59830f0e8c01fb201388f9ab"), 
    "doctorSn" : "80467"
},
{ 
    "_id" :  ("59830f0f8c01fb201388f9c1"), 
    "doctorSn" : "76494"
},
{ 
    "_id" :  ("59830f0f8c01fb201388f9cc"), 
    "doctorSn" : "73520"
},
{ 
    "_id" :  ("59830f0f8c01fb201388f9cd"), 
    "doctorSn" : "75490"
},
{ 
    "_id" :  ("59830f0f8c01fb201388f9cf"), 
    "doctorSn" : "68493"
},
{ 
    "_id" :  ("59830f0f8c01fb201388fa04"), 
    "doctorSn" : "65515"
},
{ 
    "_id" :  ("59830f158c01fb201388fccc"), 
    "doctorSn" : "70918"
},
{ 
    "_id" :  ("59830f158c01fb201388fcd5"), 
    "doctorSn" : "71810"
},
{ 
    "_id" :  ("59830f178c01fb201388fd33"), 
    "doctorSn" : "80491"
},
{ 
    "_id" :  ("59830f178c01fb201388fd3c"), 
    "doctorSn" : "67464"
},
{ 
    "_id" :  ("59830f248c01fb20138901f9"), 
    "doctorSn" : "70531"
},
{ 
    "_id" :  ("5ac1c9f0b8b8527a325b36e8"), 
    "doctorSn" : "80506"
}]

var data2 = [{"phone":"13681567316","name":"杨艳","doctorSn":"78445","time":"2018-12-20 12:45:49"},{"phone":"13671318119","name":"王伽略","doctorSn":"76459","time":"2018-12-20 13:14:47"},{"phone":"15611908835","name":"姜辉","doctorSn":"67463","time":"2018-12-20 13:18:45"},{"phone":"13810098187","name":"赵金霞","doctorSn":"78518","time":"2018-12-20 14:35:47"},{"phone":"15611963818","name":"吕扬","doctorSn":"82509","time":"2018-12-20 14:36:19"},{"phone":"13683657545","name":"邓晓莉","doctorSn":"76490","time":"2018-12-20 14:57:55"},{"phone":"13311555658","name":"陈宁","doctorSn":"76497","time":"2018-12-20 15:48:00"},{"phone":"13621152493","name":"马朝来","doctorSn":"73508","time":"2018-12-20 16:03:00"},{"phone":"13701321670","name":"任昀","doctorSn":"77496","time":"2018-12-20 16:05:50"},{"phone":"13691009139","name":"马晓伟","doctorSn":"79960","time":"2018-12-20 16:56:23"},{"phone":"13911688652","name":"王颖","doctorSn":"65452","time":"2018-12-20 17:17:35"},{"phone":"13693638871","name":"沈宁","doctorSn":"72473","time":"2018-12-20 18:05:11"},{"phone":"13911728374","name":"赵磊","doctorSn":"72526","time":"2018-12-20 18:07:06"},{"phone":"18600091055","name":"赵连明","doctorSn":"79476","time":"2018-12-20 18:19:35"},{"phone":"13811587659","name":"原鹏波","doctorSn":"84471","time":"2018-12-20 18:41:55"},{"phone":"13301029314","name":"张立","doctorSn":"67417","time":"2018-12-20 18:59:51"},{"phone":"13611318183","name":"罗莉","doctorSn":"73529","time":"2018-12-20 19:10:40"},{"phone":"18910192576","name":"宋志强","doctorSn":"76493","time":"2018-12-20 19:18:35"},{"phone":"15201005603","name":"徐艳","doctorSn":"67464","time":"2018-12-20 19:31:06"},{"phone":"13717531820","name":"布娟","doctorSn":"73527","time":"2018-12-20 20:13:10"},{"phone":"13810766225","name":"甄秀梅","doctorSn":"70538","time":"2018-12-20 20:23:09"},{"phone":"13488693797","name":"李薇薇","doctorSn":"83527","time":"2018-12-20 20:27:16"},{"phone":"13910778175","name":"王丽娜","doctorSn":"68493","time":"2018-12-20 20:29:35"},{"phone":"13693609918","name":"宋雪凌","doctorSn":"79447","time":"2018-12-20 20:43:22"},{"phone":"18810532804","name":"张春梅","doctorSn":"81535","time":"2018-12-20 20:49:39"},{"phone":"13661193713","name":"梁华茂","doctorSn":"70531","time":"2018-12-20 20:58:48"},{"phone":"13331031448","name":"余家阔","doctorSn":"63498","time":"2018-12-20 21:06:32"},{"phone":"13601203410","name":"黄铄","doctorSn":"78521","time":"2018-12-20 21:58:51"},{"phone":"18610377492","name":"刘蕊","doctorSn":"79443","time":"2018-12-20 22:21:52"},{"phone":"13581945087","name":"马勇","doctorSn":"77462","time":"2018-12-20 22:22:47"},{"phone":"13718128325","name":"凌晓锋","doctorSn":"68477","time":"2018-12-20 22:31:20"},{"phone":"15611908999","name":"李蓉","doctorSn":"74468","time":"2018-12-20 22:52:30"},{"phone":"13911005426","name":"孙垂国","doctorSn":"77477","time":"2018-12-20 22:52:40"},{"phone":"13701023871","name":"樊东升","doctorSn":"63488","time":"2018-12-20 23:02:46"},{"phone":"13811280948","name":"江东","doctorSn":"80491","time":"2018-12-20 23:19:52"},{"phone":"13501207016","name":"陈新娜","doctorSn":"70493","time":"2018-12-21 05:57:55"},{"phone":"13811844275","name":"李欣","doctorSn":"78503","time":"2018-12-21 07:27:35"},{"phone":"13146922808","name":"王洁净","doctorSn":"71810","time":"2018-12-21 08:00:51"},{"phone":"13021176773","name":"迟洪滨","doctorSn":"70545","time":"2018-12-21 08:38:53"},{"phone":"13683670396","name":"刘平","doctorSn":"70542","time":"2018-12-21 09:23:38"},{"phone":"13520004917","name":"李晓光","doctorSn":"77487","time":"2018-12-21 10:26:14"},{"phone":"18612270676","name":"王海军","doctorSn":"76494","time":"2018-12-21 10:32:43"},{"phone":"13501213023","name":"洪锴","doctorSn":"73520","time":"2018-12-21 10:57:19"},{"phone":"13581928659","name":"龙晓宇","doctorSn":"79510","time":"2018-12-21 11:35:19"},{"phone":"15901319865","name":"刘烨","doctorSn":"85445","time":"2018-12-21 12:51:17"},{"phone":"13522161891","name":"李红真","doctorSn":"64503","time":"2018-12-21 13:31:12"},{"phone":"13910782530","name":"夏志伟","doctorSn":"64484","time":"2018-12-21 14:16:29"},{"phone":"13691050318","name":"崔龙","doctorSn":"78487","time":"2018-12-21 14:30:58"},{"phone":"15611042118","name":"王皓","doctorSn":"79462","time":"2018-12-21 15:54:31"},{"phone":"13811426475","name":"李渊","doctorSn":"73480","time":"2018-12-21 16:38:01"},{"phone":"13661365132","name":"王威","doctorSn":"77474","time":"2018-12-21 17:32:43"},{"phone":"13810002686","name":"田勍","doctorSn":"81463","time":"2018-12-21 18:01:17"},{"phone":"13651062954","name":"王艳荣","doctorSn":"64494","time":"2018-12-21 18:04:06"},{"phone":"15801285588","name":"姚中强","doctorSn":"72533","time":"2018-12-21 18:05:36"},{"phone":"13810349928","name":"杨硕","doctorSn":"83491","time":"2018-12-21 18:08:17"},{"phone":"15110125914","name":"刘慧","doctorSn":"83521","time":"2018-12-21 18:09:11"},{"phone":"18618128175","name":"李磊","doctorSn":"75450","time":"2018-12-21 18:10:47"},{"phone":"13911994881","name":"王悦","doctorSn":"63526","time":"2018-12-21 18:15:40"},{"phone":"13693356597","name":"唐文豪","doctorSn":"75490","time":"2018-12-21 18:35:52"},{"phone":"15901499591","name":"姜薇","doctorSn":"73497","time":"2018-12-21 18:42:06"},{"phone":"13911765322","name":"黄永辉","doctorSn":"65515","time":"2018-12-21 18:56:23"},{"phone":"13611326481","name":"刘平","doctorSn":"59401","time":"2018-12-21 19:31:11"},{"phone":"13488738813","name":"刘德风","doctorSn":"83531","time":"2018-12-21 19:34:15"},{"phone":"13611206327","name":"朴梅花","doctorSn":"62475","time":"2018-12-21 19:49:17"},{"phone":"13121969380","name":"王松","doctorSn":"68463","time":"2018-12-21 20:09:41"},{"phone":"13801076267","name":"王健全","doctorSn":"66459","time":"2018-12-21 20:16:53"},{"phone":"13683095805","name":"赵红梅","doctorSn":"69451","time":"2018-12-21 20:45:23"},{"phone":"18301243816","name":"智旭","doctorSn":"75515","time":"2018-12-21 20:49:19"},{"phone":"15611908796","name":"何震明","doctorSn":"76434","time":"2018-12-21 21:08:08"},{"phone":"13611000816","name":"杨渝平","doctorSn":"76435","time":"2018-12-21 21:47:32"},{"phone":"13552841890","name":"刁垠泽","doctorSn":"77495","time":"2018-12-21 22:01:29"},{"phone":"13811232349","name":"叶剑飞","doctorSn":"84465","time":"2018-12-21 22:19:26"},{"phone":"13439476080","name":"贺豪杰","doctorSn":"76500","time":"2018-12-21 23:21:05"},{"phone":"13011086079","name":"周薇","doctorSn":"65421","time":"2018-12-21 23:43:55"},{"phone":"13701089620","name":"乔杰","doctorSn":"64470","time":"2018-12-22 00:15:01"},{"phone":"13911890993","name":"王永清","doctorSn":"66472","time":"2018-12-22 00:45:43"},{"phone":"13693226760","name":"解倩","doctorSn":"75447","time":"2018-12-22 03:29:34"},{"phone":"18611104595","name":"闫洪梅","doctorSn":"70918","time":"2018-12-22 06:49:56"},{"phone":"13501000412","name":"白洋","doctorSn":"77459","time":"2018-12-22 12:14:48"},{"phone":"13681240018","name":"常艳美","doctorSn":"75495","time":"2018-12-22 12:16:39"},{"phone":"13426376041","name":"彭荣梅","doctorSn":"83507","time":"2018-12-22 12:17:39"},{"phone":"13811089790","name":"李蕾","doctorSn":"78499","time":"2018-12-22 14:31:49"},{"phone":"13717761768","name":"种轶文","doctorSn":"81493","time":"2018-12-22 14:51:14"},{"phone":"13501221484","name":"孙宇","doctorSn":"60429","time":"2018-12-22 17:45:08"},{"phone":"13581514603","name":"邱敏","doctorSn":"85442","time":"2018-12-22 18:08:52"},{"phone":"15611908041","name":"陈晓勇","doctorSn":"78469","time":"2018-12-22 18:09:20"},{"phone":"13501095002","name":"李小刚","doctorSn":"64441","time":"2018-12-22 18:09:21"},{"phone":"13691333970","name":"姜亮","doctorSn":"71508","time":"2018-12-22 20:53:23"},{"phone":"15611963530","name":"刘楠","doctorSn":"80443","time":"2018-12-22 21:24:05"},{"phone":"13683324481","name":"汤亚南","doctorSn":"73522","time":"2018-12-22 22:06:31"},{"phone":"13661319838","name":"王海燕","doctorSn":"65511","time":"2018-12-22 22:45:04"},{"phone":"18611557498","name":"陈临新","doctorSn":"80467","time":"2018-12-22 23:04:58"},{"phone":"13910009389","name":"王凯","doctorSn":"84513","time":"2018-12-23 12:11:03"},{"phone":"13810937522","name":"郑建淮","doctorSn":"56802","time":"2018-12-23 13:06:52"},{"phone":"13683360843","name":"江元慧","doctorSn":"74485","time":"2018-12-23 17:57:55"},{"phone":"13051776232","name":"庄洪卿","doctorSn":"80506","time":"2018-12-23 18:21:04"},{"phone":"13801153779","name":"郭昭庆","doctorSn":"66458","time":"2018-12-23 19:08:50"},{"phone":"18611372996","name":"张璐芳","doctorSn":"57453","time":"2018-12-23 21:58:02"},{"phone":"18510800073","name":"邓凤","doctorSn":"82541","time":"2018-12-23 22:59:02"},{"phone":"18611643002","name":"梅宇","doctorSn":"78456","time":"2018-12-23 22:59:50"},{"phone":"13683553716","name":"刘玉雷","doctorSn":"80492","time":"2018-12-24 00:25:24"},{"phone":"18618269437","name":"王文慧","doctorSn":"80446","time":"2018-12-24 07:08:38"},{"phone":"13910660108","name":"王晓晔","doctorSn":"73505","time":"2018-12-24 10:42:18"}]

var sn = []
var nn = []
var mm  = []
for (let m of data1) {
    mm.push(m.doctorSn)
}
console.log(mm.length)
for (let n of data2){
    nn.push(n.doctorSn) 
}
console.log(nn.length)
for (let element of nn) {
    let flag = true
    for (let item of mm)
        if (element.doctorSn === item.doctorSn) {
            flag = false
        }
    if(flag) console.log('********', element)
}